---
kind: enumMember
id: F:Autodesk.Revit.DB.TemporaryViewMode.TemporaryViewProperties
enum: Autodesk.Revit.DB.TemporaryViewMode
source: html/8c0c72db-2801-3642-72bb-108cfdff23e1.htm
---
# Autodesk.Revit.DB.TemporaryViewMode.TemporaryViewProperties

The view is in the selected View Properties applied temporarily.